stas00n/EasyChart/fatfs/sd_spi_driver_stm32f0.c
#if (STM32_SD_DISK_IOCTRL == 1)
DRESULT disk_ioctl (
	BYTE drv,		/* Physical drive number (0) */
	BYTE ctrl,		/* Control code */
	void *buff		/* Buffer to send/receive control data */
)
{
	DRESULT res;
	BYTE n, csd[16], *ptr = (BYTE*)buff;
	WORD csize;

	if (drv) return RES_PARERR;

	res = RES_ERROR;

	if (ctrl == CTRL_POWER) {
		switch (*ptr) {
		case 0:		/* Sub control code == 0 (POWER_OFF) */
			if (chk_power())
				power_off();		/* Power off */
			res = RES_OK;
			break;
		case 1:		/* Sub control code == 1 (POWER_ON) */
			power_on();				/* Power on */
			res = RES_OK;
			break;
		case 2:		/* Sub control code == 2 (POWER_GET) */
			*(ptr+1) = (BYTE)chk_power();
			res = RES_OK;
			break;
		default :
			res = RES_PARERR;
		}
	}
	else {
		if (Stat & STA_NOINIT) return RES_NOTRDY;

		switch (ctrl) {
		case CTRL_SYNC :		/* Make sure that no pending write process */
			SELECT();
			if (wait_ready() == 0xFF)
				res = RES_OK;
			break;

		case GET_SECTOR_COUNT :	/* Get number of sectors on the disk (DWORD) */
			if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {
				if ((csd[0] >> 6) == 1) {	/* SDC version 2.00 */
					csize = csd[9] + ((WORD)csd[8] << 8) + 1;
					*(DWORD*)buff = (DWORD)csize << 10;
				} else {					/* SDC version 1.XX or MMC*/
					n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
					csize = (csd[8] >> 6) + ((WORD)csd[7] << 2) + ((WORD)(csd[6] & 3) << 10) + 1;
					*(DWORD*)buff = (DWORD)csize << (n - 9);
				}
				res = RES_OK;
			}
			break;

		case GET_SECTOR_SIZE :	/* Get R/W sector size (WORD) */
			*(WORD*)buff = 512;
			res = RES_OK;
			break;

		case GET_BLOCK_SIZE :	/* Get erase block size in unit of sector (DWORD) */
			if (CardType & CT_SD2) {	/* SDC version 2.00 */
				if (send_cmd(ACMD13, 0) == 0) {	/* Read SD status */
					rcvr_spi();
					if (rcvr_datablock(csd, 16)) {				/* Read partial block */
						for (n = 64 - 16; n; n--) rcvr_spi();	/* Purge trailing data */
						*(DWORD*)buff = 16UL << (csd[10] >> 4);
						res = RES_OK;
					}
				}
			} else {					/* SDC version 1.XX or MMC */
				if ((send_cmd(CMD9, 0) == 0) && rcvr_datablock(csd, 16)) {	/* Read CSD */
					if (CardType & CT_SD1) {	/* SDC version 1.XX */
						*(DWORD*)buff = (((csd[10] & 63) << 1) + ((WORD)(csd[11] & 128) >> 7) + 1) << ((csd[13] >> 6) - 1);
					} else {					/* MMC */
						*(DWORD*)buff = ((WORD)((csd[10] & 124) >> 2) + 1) * (((csd[11] & 3) << 3) + ((csd[11] & 224) >> 5) + 1);
					}
					res = RES_OK;
				}
			}
			break;

		case MMC_GET_TYPE :		/* Get card type flags (1 byte) */
			*ptr = CardType;
			res = RES_OK;
			break;

		case MMC_GET_CSD :		/* Receive CSD as a data block (16 bytes) */
			if (send_cmd(CMD9, 0) == 0		/* READ_CSD */
				&& rcvr_datablock(ptr, 16))
				res = RES_OK;
			break;

		case MMC_GET_CID :		/* Receive CID as a data block (16 bytes) */
			if (send_cmd(CMD10, 0) == 0		/* READ_CID */
				&& rcvr_datablock(ptr, 16))
				res = RES_OK;
			break;

		case MMC_GET_OCR :		/* Receive OCR as an R3 resp (4 bytes) */
			if (send_cmd(CMD58, 0) == 0) {	/* READ_OCR */
				for (n = 4; n; n--) *ptr++ = rcvr_spi();
				res = RES_OK;
			}
			break;

		case MMC_GET_SDSTAT :	/* Receive SD status as a data block (64 bytes) */
			if (send_cmd(ACMD13, 0) == 0) {	/* SD_STATUS */
				rcvr_spi();
				if (rcvr_datablock(ptr, 64))
					res = RES_OK;
			}
			break;

		default:
			res = RES_PARERR;
		}

		release_spi();
	}

	return res;
}
#endif /* _USE_IOCTL != 0 */


/*-----------------------------------------------------------------------*/
/* Device Timer Interrupt Procedure  (Platform dependent)                */
/*-----------------------------------------------------------------------*/
/* This function must be called in period of 10ms                        */

RAMFUNC void disk_timerproc (void)
{
	static DWORD pv;
	DWORD ns;
	BYTE n, s;


	n = Timer1;                /* 100Hz decrement timers */
	if (n) Timer1 = --n;
	n = Timer2;
	if (n) Timer2 = --n;

	ns = pv;
	pv = socket_is_empty() | socket_is_write_protected();	/* Sample socket switch */

	if (ns == pv) {                         /* Have contacts stabled? */
		s = Stat;

		if (pv & socket_state_mask_wp)      /* WP is H (write protected) */
			s |= STA_PROTECT;
		else                                /* WP is L (write enabled) */
			s &= ~STA_PROTECT;

		if (pv & socket_state_mask_cp)      /* INS = H (Socket empty) */
			s |= (STA_NODISK | STA_NOINIT);
		else                                /* INS = L (Card inserted) */
			s &= ~STA_NODISK;

		Stat = s;
	}
}



extern "C" void spi_dma_read(BYTE* buff, UINT btr)
{
  DMA_DeInit(DMA_Channel_SPI_SD_RX);
  DMA_DeInit(DMA_Channel_SPI_SD_TX);
  
  DMA_InitTypeDef dma;
  
  dma.DMA_PeripheralBaseAddr = (DWORD)(&(SPI_SD->DR));
  dma.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
  dma.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  dma.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  dma.DMA_BufferSize = btr;
  dma.DMA_Mode = DMA_Mode_Normal;
  dma.DMA_Priority = DMA_Priority_VeryHigh;
  dma.DMA_M2M = DMA_M2M_Disable;
  
  dma.DMA_MemoryBaseAddr = (DWORD)buff;
  dma.DMA_DIR = DMA_DIR_PeripheralSRC;
  dma.DMA_MemoryInc = DMA_MemoryInc_Enable;
  
  DMA_Init(DMA_Channel_SPI_SD_RX, &dma);
  
  dma.DMA_MemoryBaseAddr = (uint32_t)&dmaTxDummy;
  dma.DMA_DIR = DMA_DIR_PeripheralDST;
  dma.DMA_MemoryInc = DMA_MemoryInc_Disable;
  
  DMA_Init(DMA_Channel_SPI_SD_TX, &dma);
  
  
  // Enable RX TC interrupt
  DMA_ITConfig(DMA_Channel_SPI_SD_RX, DMA_IT_TC, ENABLE);
  // Enable DMA RX Channel
  DMA_Cmd(DMA_Channel_SPI_SD_RX, ENABLE);
  // Enable DMA TX Channel
  DMA_Cmd(DMA_Channel_SPI_SD_TX, ENABLE);
  // Enable SPI TX/RX request
  SPI_I2S_DMACmd(SPI_SD, SPI_I2S_DMAReq_Rx | SPI_I2S_DMAReq_Tx, ENABLE);
}

//-----------------------------------------------------------------------------
void SD_SPI_Driver_Init()
{
  // TIM 100Hz
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM16, ENABLE);

  TIM_TimeBaseInitTypeDef tb;
  tb.TIM_ClockDivision = TIM_CKD_DIV4;
  tb.TIM_CounterMode = TIM_CounterMode_Up;
  tb.TIM_Prescaler = 12 - 1;    // (TIM_CLK = 48MHz) / 12 -> CK_PSC = 4 MHz 
  tb.TIM_Period = 40000 - 1;    // 4 MHz / 40000 -> 100 Hz TIM_Update
  tb.TIM_RepetitionCounter = 0;
  
  TIM_TimeBaseInit(TIM16, &tb);
  
  // TIM interrupts
  TIM_ITConfig(TIM16, TIM_IT_Update, ENABLE);
  NVIC_InitTypeDef nvic;
  
  nvic.NVIC_IRQChannel = TIM16_IRQn;
  // Tim int priority should be greater than dma int priority
  nvic.NVIC_IRQChannelPriority = 0;
  nvic.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&nvic);
  
  TIM_Cmd(TIM16, ENABLE);
  
  // DMA Clock
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
  
  // DMA interrupts
  nvic.NVIC_IRQChannel = DMA1_Channel2_3_IRQn;
  nvic.NVIC_IRQChannelPriority = 1;
  nvic.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&nvic);
}

//------------------------------------------------------------------------------
extern "C" void TIM16_IRQHandler()
{
  // Decrement soft timers
  if(Timer1 > 0) Timer1--;
  if(Timer2 > 0) Timer2--;
  
  TIM16->SR = ~TIM_FLAG_Update;
}

